# Web Scraping

- Tecnica web scraping
- Utilização de funçoes basicas do pandas
- Manipulação de Strings
- Pesquisas usando Pandas
- Criação e tranformação de DataFrames
- Revisão de funçoes 
- Utilização de Função dentro do Notebook
- Renomear colunas
- Atualizar DataFrames (original)
- Dicas para estudar e trabalhar com expressões regulares
- Pacotes para Web

### 1.1 LINK para Raspagem

https://www.terra.com.br/esportes/futebol/brasileiro-serie-a/tabela/#google_vignette

Leis locais (Brasil)
- LGPD (Lei Geral de Proteção de Dados)
- Ética e responsabilidade

### 1.2 Ler um HTML

In [4]:
# Definir uma variavel (é um espaço reservado na memoria do computador)

url = "https://www.terra.com.br/esportes/futebol/brasileiro-serie-a/tabela/#google_vignette"

### 1.3 Instalar e Importar o pandas o PANDAS

In [ ]:
! pip install pandas

In [2]:
import pandas as pd

In [5]:
# Tipagem Dinâmica
# tipo é definido como tempo de execução
type(url)

str

### 1.4 Ler HTML com Pandas

In [11]:
tabela_brasileirao = pd.read_html(url,encoding='utf-8')
# Use o utf-8 ou ISO-8859-1

### 1.5 Instalar a biblioteca LXML

In [10]:
! pip install lxml

Collecting lxml
  Using cached lxml-5.2.2-cp312-cp312-win_amd64.whl.metadata (3.5 kB)
Using cached lxml-5.2.2-cp312-cp312-win_amd64.whl (3.8 MB)
Installing collected packages: lxml
Successfully installed lxml-5.2.2

### Bibliotecas para Web Scraping 
- htmlslib
- beautifulsoup4
- lxml

In [28]:
url = "https://ge.globo.com/esports/blogs/por-dentro-dos-esports/post/2024/04/03/vct-americas-2024-etapa-1-tabela-jogos-formato-e-mais.ghtml"

In [29]:
tabela_vctamericas = pd.read_html(url,encoding='utf-8')

In [30]:
tabela_vctamericas

[    0           1             2            3                4              5  \
 0   #  Grupo Alfa  Séries (V-D)  Mapas (V-D)  Saldo de rounds    Grupo Ômega
 1  1º         KRÜ           5-1         11-4              +43       Leviatán
 2  2º      Cloud9           5-1         10-6              +20    100 Thieves
 3  3º          G2           3-3          7-6              +23           LOUD
 4  4º   Sentinels           3-3          7-6              +21  Evil Geniuses
 5  5º         NRG           3-3          7-6               +8          FURIA
 6  6º         NaN           NaN          NaN              NaN           MIBR

               6            7                8
 0  Séries (V-D)  Mapas (V-D)  Saldo de rounds
 1           4-1          9-4              +36
 2           3-2          7-4              +14
 3           2-3          5-6              -13
 4           2-3          5-8              -28
 5           0-5         2-10              -62
 6           0-5         0-10              -62  ]

### 1.6 Conversão para DataFrame

### tabela_vctamericas.head() NÃO FUNIONA

In [33]:
tabela_vctamericas.head()

AttributeError: 'list' object has no attribute 'head'

### Para funcionar converta para um DataFrame

In [34]:
df = tabela_vctamericas[0]
df.head(20)

,0,1,2,3,4,5,6,7,8
0,#,Grupo Alfa,Séries (V-D),Mapas (V-D),Saldo de rounds,Grupo Ômega,Séries (V-D),Mapas (V-D),Saldo de rounds
1,1º,KRÜ,5-1,11-4,+43,Leviatán,4-1,9-4,+36
2,2º,Cloud9,5-1,10-6,+20,100 Thieves,3-2,7-4,+14
3,3º,G2,3-3,7-6,+23,LOUD,2-3,5-6,-13
4,4º,Sentinels,3-3,7-6,+21,Evil Geniuses,2-3,5-8,-28
5,5º,NRG,3-3,7-6,+8,FURIA,0-5,2-10,-62
6,6º,NaN,NaN,NaN,NaN,MIBR,0-5,0-10,-62

### 1.7 Mostrar o Resultado da Raspagem

In [36]:
tabela_vctamericas

[    0           1             2            3                4              5  \
 0   #  Grupo Alfa  Séries (V-D)  Mapas (V-D)  Saldo de rounds    Grupo Ômega
 1  1º         KRÜ           5-1         11-4              +43       Leviatán
 2  2º      Cloud9           5-1         10-6              +20    100 Thieves
 3  3º          G2           3-3          7-6              +23           LOUD
 4  4º   Sentinels           3-3          7-6              +21  Evil Geniuses
 5  5º         NRG           3-3          7-6               +8          FURIA
 6  6º         NaN           NaN          NaN              NaN           MIBR

               6            7                8
 0  Séries (V-D)  Mapas (V-D)  Saldo de rounds
 1           4-1          9-4              +36
 2           3-2          7-4              +14
 3           2-3          5-6              -13
 4           2-3          5-8              -28
 5           0-5         2-10              -62
 6           0-5         0-10              -62  ]

In [37]:
tabela_brasileirao

[    Times  Times.1                 Times.2  Times.3   P   J   V  E   D  GP  \
 0       1      NaN             Botafogo >>   Subiu1  43  21  13  4   4  35
 1       2      NaN             Flamengo >>  Desceu1  40  20  12  4   4  34
 2       3      NaN            Fortaleza >>   Subiu1  39  20  11  6   3  26
 3       4      NaN            Palmeiras >>  Desceu1  37  21  11  4   6  28
 4       5      NaN             Cruzeiro >>      NaN  35  20  11  2   7  29
 5       6      NaN            São Paulo >>      NaN  35  21  10  5   6  29
 6       7      NaN                Bahia >>      NaN  32  21   9  5   7  29
 7       8      NaN         Athletico-PR >>      NaN  28  19   8  4   7  22
 8       9      NaN          Atlético-MG >>      NaN  28  19   7  7   5  28
 9      10      NaN           Bragantino >>      NaN  26  19   7  5   7  24
 10     11      NaN        Vasco da Gama >>      NaN  24  20   7  3  10  22
 11     12      NaN             Criciúma >>      NaN  24  19   6  6   7  28
 12     13      NaN            Juventude >>      NaN  22  19   5  7   7  21
 13     14      NaN               Grêmio >>   Subiu2  21  19   6  3  10  17
 14     15      NaN              Vitória >>   Subiu2  21  21   6  3  12  23
 15     16      NaN        Internacional >>  Desceu2  21  16   5  6   5  14
 16     17      NaN           Fluminense >>   Subiu2  20  20   5  5  10  16
 17     18      NaN          Corinthians >>  Desceu3  20  21   4  8   9  19
 18     19      NaN               Cuiabá >>  Desceu1  17  19   4  5  10  19
 19     20      NaN  Atlético Goianiense >>      NaN  12  21   2  6  13  17

     GC  SG   %
 0   20  15  68
 1   20  14  66
 2   19   7  65
 3   17  11  58
 4   22   7  58
 5   21   8  55
 6   25   4  50
 7   20   2  49
 8   28   0  49
 9   23   1  45
 10  31  -9  40
 11  29  -1  42
 12  25  -4  38
 13  22  -5  36
 14  32  -9  33
 15  14   0  43
 16  24  -8  33
 17  28  -9  31
 18  25  -6  29
 19  35 -18  19  ]

### 1.8 Mostrar os 5 primeiros

In [38]:
df.head(5)

,0,1,2,3,4,5,6,7,8
0,#,Grupo Alfa,Séries (V-D),Mapas (V-D),Saldo de rounds,Grupo Ômega,Séries (V-D),Mapas (V-D),Saldo de rounds
1,1º,KRÜ,5-1,11-4,+43,Leviatán,4-1,9-4,+36
2,2º,Cloud9,5-1,10-6,+20,100 Thieves,3-2,7-4,+14
3,3º,G2,3-3,7-6,+23,LOUD,2-3,5-6,-13
4,4º,Sentinels,3-3,7-6,+21,Evil Geniuses,2-3,5-8,-28

### 1.9 Mostrar os 5 ultimos

In [39]:
df.tail(5)

    0          1    2     3    4              5    6     7    8
2  2º     Cloud9  5-1  10-6  +20    100 Thieves  3-2   7-4  +14
3  3º         G2  3-3   7-6  +23           LOUD  2-3   5-6  -13
4  4º  Sentinels  3-3   7-6  +21  Evil Geniuses  2-3   5-8  -28
5  5º        NRG  3-3   7-6   +8          FURIA  0-5  2-10  -62
6  6º        NaN  NaN   NaN  NaN           MIBR  0-5  0-10  -62

### 1.10 Mostrar varias colunas

In [45]:
df[[1,2]]

            1             2
0  Grupo Alfa  Séries (V-D)
1         KRÜ           5-1
2      Cloud9           5-1
3          G2           3-3
4   Sentinels           3-3
5         NRG           3-3
6         NaN           NaN

### 1.11 Mostrar informações estruturais do DataFrame

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 9 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       7 non-null      object
 1   1       6 non-null      object
 2   2       6 non-null      object
 3   3       6 non-null      object
 4   4       6 non-null      object
 5   5       7 non-null      object
 6   6       7 non-null      object
 7   7       7 non-null      object
 8   8       7 non-null      object
dtypes: object(9)
memory usage: 636.0+ bytes

### 1.12 Mostrar informaçoes de estatistica descritiva do DataFrame

In [48]:
df.describe()

,0,1,2,3,4,5,6,7,8
count,7,6,6,6,6,7,7,7,7
unique,7,6,3,4,6,7,5,7,6
top,#,Grupo Alfa,3-3,7-6,Saldo de rounds,Grupo Ômega,0-5,Mapas (V-D),-62
freq,1,1,3,3,1,1,2,1,2

1.13 Mostrar informações da coluna 1 e 0

In [50]:
df[[0,1]]

    0           1
0   #  Grupo Alfa
1  1º         KRÜ
2  2º      Cloud9
3  3º          G2
4  4º   Sentinels
5  5º         NRG
6  6º         NaN

### 1.14 Renomeando a coluna

In [59]:
df.rename(columns={0:'Colocação'},inplace=True)

In [60]:
df.rename(columns={1:'Grupo Alfa'},inplace=True)

In [62]:
df[["Colocação","Grupo Alfa"]]

  Colocação  Grupo Alfa
0         #  Grupo Alfa
1        1º         KRÜ
2        2º      Cloud9
3        3º          G2
4        4º   Sentinels
5        5º         NRG
6        6º         NaN

# seu lixo como que pode isso, tu n fez nada monkey

w